Z_h_PV/testcases/laminarFlamelet/B-Results/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
expressions
(
    PV
    {
        field       PV;
        dimensions  [0 0 0 0 0 0 0];

//        constants
//        {
//        }

        variables
        (
            "PV0 = -7.1736792216e-03"
            "PV1 = 7.1669021364e-03"
            "xIgn = 1.5e-2"
            "dxIgn = 0.1e-2"
            //"dxIgn = 1.0e-2"
        );

        fieldMask
        #{
            (pos().x() > xIgn - 0.5*dxIgn) && (pos().x() < xIgn + 0.5*dxIgn)
        #};

        expression
        #{
            (PV1 - PV0)/dxIgn * pos().x() + PV0 - (PV1 - PV0)/dxIgn * (xIgn - 0.5*dxIgn)
        #};
    }
);
/*expressions
(
    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];

//        constants
//        {
//        }

        variables
        (
            "delta     = 8.75e-3"
            "Ubar      = 10.0"
            "deviation = 15*(rand() - 0.5)"
        );

        condition
        #{
            (pos().x() > 0)
        #};

        expression
        #{
            vector
            (
                6*Ubar*(pos().y()/(2*delta)*(1 - pos().y()/(2*delta))) + deviation,
                deviation,
                deviation
            )
        #};
    }
);*/

// ************************************************************************* //
